itsmejay18/Piso-Power-Station-Project-ESP32-IOT/piso-charging-esp8266/src/main.cpp
#include <Arduino.h>
#include <DNSServer.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <LittleFS.h>

static const char* BOARD_NAME = "ESP8266_NODEMCU";
static const char* DEFAULT_AP_SSID = "PISO_CHARGE_PRO";
static const char* DEFAULT_AP_PASS = "12345678";
static const char* DEFAULT_ADMIN_PASS = "admin";
static const bool DEFAULT_RELAY_ACTIVE_LOW = false;
static const char* CONFIG_PATH = "/config.json";
static const byte DNS_PORT = 53;
static const unsigned long COIN_DEBOUNCE_MS = 20;
static const unsigned long COIN_TRAIN_TIMEOUT_MS = 1100;
static const unsigned long RELAY_TEST_MS = 900;

IPAddress AP_IP(10, 20, 30, 1);
IPAddress AP_GATEWAY(10, 20, 30, 1);
IPAddress AP_SUBNET(255, 255, 255, 0);

ESP8266WebServer server(80);
DNSServer dnsServer;

struct PinOption {
  const char* name;
  uint8_t gpio;
};

static const PinOption SAFE_PIN_OPTIONS[] = {
  {"D1", D1},
  {"D2", D2},
  {"D5", D5},
  {"D6", D6},
  {"D7", D7}
};

struct Settings {
  String apSsid;
  String apPassword;
  String adminPassword;
  String relayPins[3];
  String coinPin;
  bool relayActiveLow;
  uint32_t secondsPerCoin;
  bool portEnabled[3];
};

struct PortState {
  uint32_t remaining;
  bool relayOn;
};

Settings settings;
PortState ports[3];

uint32_t creditSeconds = 0;
uint32_t coinPulses = 0;
uint32_t coinValueTotal = 0;
unsigned long lastTimerMs = 0;
bool coinRawActive = false;
bool coinStableActive = false;
unsigned long coinRawChangedMs = 0;
uint8_t pendingCoinPulses = 0;
uint8_t lastCoinValue = 0;
unsigned long lastCoinPulseMs = 0;
bool rebootPending = false;
unsigned long rebootAtMs = 0;
bool relayTestActive[3] = {false, false, false};
unsigned long relayTestUntilMs[3] = {0, 0, 0};
String sessionToken = "";

String jsonEscape(const String& value) {
  String out;
  out.reserve(value.length() + 8);
  for (size_t i = 0; i < value.length(); i++) {
    char c = value.charAt(i);
    if (c == '"' || c == '\\') {
      out += '\\';
      out += c;
    } else if (c == '\n') {
      out += "\\n";
    } else if (c == '\r') {
      out += "\\r";
    } else {
      out += c;
    }
  }
  return out;
}

String readJsonString(const String& json, const String& key) {
  String needle = "\"" + key + "\"";
  int keyPos = json.indexOf(needle);
  if (keyPos < 0) return "";
  int colon = json.indexOf(':', keyPos + needle.length());
  if (colon < 0) return "";
  int start = colon + 1;
  while (start < (int)json.length() && isspace(json.charAt(start))) start++;
  if (start >= (int)json.length() || json.charAt(start) != '"') return "";
  start++;

  String out;
  bool escaped = false;
  for (int i = start; i < (int)json.length(); i++) {
    char c = json.charAt(i);
    if (escaped) {
      if (c == 'n') out += '\n';
      else if (c == 'r') out += '\r';
      else out += c;
      escaped = false;
    } else if (c == '\\') {
      escaped = true;
    } else if (c == '"') {
      break;
    } else {
      out += c;
    }
  }
  return out;
}

int readJsonInt(const String& json, const String& key, int fallback) {
  String needle = "\"" + key + "\"";
  int keyPos = json.indexOf(needle);
  if (keyPos < 0) return fallback;
  int colon = json.indexOf(':', keyPos + needle.length());
  if (colon < 0) return fallback;
  int start = colon + 1;
  while (start < (int)json.length() && isspace(json.charAt(start))) start++;
  int end = start;
  while (end < (int)json.length()) {
    char c = json.charAt(end);
    if (!isdigit(c) && c != '-') break;
    end++;
  }
  if (end <= start) {
    String asString = readJsonString(json, key);
    if (asString.length() == 0) return fallback;
    return asString.toInt();
  }
  return json.substring(start, end).toInt();
}

bool readJsonBool(const String& json, const String& key, bool fallback) {
  String needle = "\"" + key + "\"";
  int keyPos = json.indexOf(needle);
  if (keyPos < 0) return fallback;
  int colon = json.indexOf(':', keyPos + needle.length());
  if (colon < 0) return fallback;
  int start = colon + 1;
  while (start < (int)json.length() && isspace(json.charAt(start))) start++;
  if (json.startsWith("true", start)) return true;
  if (json.startsWith("false", start)) return false;
  if (json.charAt(start) == '1') return true;
  if (json.charAt(start) == '0') return false;

  String asString = readJsonString(json, key);
  asString.toLowerCase();
  return asString == "true" || asString == "1" || asString == "on" || asString == "yes";
}

void setDefaultSettings() {
  settings.apSsid = DEFAULT_AP_SSID;
  settings.apPassword = DEFAULT_AP_PASS;
  settings.adminPassword = DEFAULT_ADMIN_PASS;
  settings.relayPins[0] = "D1";
  settings.relayPins[1] = "D2";
  settings.relayPins[2] = "D5";
  settings.coinPin = "D6";
  settings.relayActiveLow = DEFAULT_RELAY_ACTIVE_LOW;
  settings.secondsPerCoin = 300;
  settings.portEnabled[0] = true;
  settings.portEnabled[1] = true;
  settings.portEnabled[2] = true;
}

String normalizePinName(String value, const String& fallback) {
  value.trim();
  value.toUpperCase();
  for (size_t i = 0; i < sizeof(SAFE_PIN_OPTIONS) / sizeof(SAFE_PIN_OPTIONS[0]); i++) {
    if (value == SAFE_PIN_OPTIONS[i].name) return value;
  }
  return fallback;
}

uint8_t gpioForPinName(const String& pinName, uint8_t fallback) {
  for (size_t i = 0; i < sizeof(SAFE_PIN_OPTIONS) / sizeof(SAFE_PIN_OPTIONS[0]); i++) {
    if (pinName == SAFE_PIN_OPTIONS[i].name) return SAFE_PIN_OPTIONS[i].gpio;
  }
  return fallback;
}

bool pinsAreUnique() {
  String names[4] = {
    settings.relayPins[0],
    settings.relayPins[1],
    settings.relayPins[2],
    settings.coinPin
  };
  for (int i = 0; i < 4; i++) {
    for (int j = i + 1; j < 4; j++) {
      if (names[i] == names[j]) return false;
    }
  }
  return true;
}

bool pinNamesAreUnique(const String& first, const String& second, const String& third, const String& fourth) {
  String names[4] = {first, second, third, fourth};
  for (int i = 0; i < 4; i++) {
    for (int j = i + 1; j < 4; j++) {
      if (names[i] == names[j]) return false;
    }
  }
  return true;
}

void sanitizeSettings() {
  settings.apSsid.trim();
  settings.apPassword.trim();
  settings.adminPassword.trim();
  if (settings.apSsid.length() == 0) settings.apSsid = DEFAULT_AP_SSID;
  if (settings.apPassword.length() < 8) settings.apPassword = DEFAULT_AP_PASS;
  if (settings.adminPassword.length() == 0) settings.adminPassword = DEFAULT_ADMIN_PASS;
  settings.relayPins[0] = normalizePinName(settings.relayPins[0], "D1");
  settings.relayPins[1] = normalizePinName(settings.relayPins[1], "D2");
  settings.relayPins[2] = normalizePinName(settings.relayPins[2], "D5");
  settings.coinPin = normalizePinName(settings.coinPin, "D6");
  if (!pinsAreUnique()) {
    settings.relayPins[0] = "D1";
    settings.relayPins[1] = "D2";
    settings.relayPins[2] = "D5";
    settings.coinPin = "D6";
  }
  if (settings.secondsPerCoin < 10 || settings.secondsPerCoin > 86400UL) {
    settings.secondsPerCoin = 300;
  }
}

uint8_t relayGpio(int index) {
  static const uint8_t fallbackPins[] = {D1, D2, D5};
  return gpioForPinName(settings.relayPins[index], fallbackPins[index]);
}

uint8_t coinGpio() {
  return gpioForPinName(settings.coinPin, D6);
}

