itsmejay18/Piso-Power-Station-Project-ESP32-IOT/piso-charging-esp8266/src/main.cpp
int relayOnLevel() {
  return settings.relayActiveLow ? LOW : HIGH;
}

int relayOffLevel() {
  return settings.relayActiveLow ? HIGH : LOW;
}

String contentTypeFor(const String& path) {
  if (path.endsWith(".html")) return "text/html";
  if (path.endsWith(".css")) return "text/css";
  if (path.endsWith(".js")) return "application/javascript";
  if (path.endsWith(".json")) return "application/json";
  if (path.endsWith(".png")) return "image/png";
  if (path.endsWith(".jpg") || path.endsWith(".jpeg")) return "image/jpeg";
  if (path.endsWith(".ico")) return "image/x-icon";
  return "text/plain";
}

bool serveFile(String path) {
  if (path.endsWith("/")) path += "index.html";
  if (!LittleFS.exists(path)) return false;
  File file = LittleFS.open(path, "r");
  if (!file) return false;
  server.sendHeader("Cache-Control", "no-store");
  server.streamFile(file, contentTypeFor(path));
  file.close();
  return true;
}

void sendJson(int status, const String& body) {
  server.sendHeader("Cache-Control", "no-store");
  server.send(status, "application/json", body);
}

String requestValue(const String& key) {
  if (server.hasArg(key)) return server.arg(key);
  if (!server.hasArg("plain")) return "";
  return readJsonString(server.arg("plain"), key);
}

int requestInt(const String& key, int fallback) {
  if (server.hasArg(key)) return server.arg(key).toInt();
  if (server.hasArg("plain")) return readJsonInt(server.arg("plain"), key, fallback);
  return fallback;
}

bool requestBool(const String& key, bool fallback) {
  if (server.hasArg(key)) {
    String value = server.arg(key);
    value.toLowerCase();
    return value == "1" || value == "true" || value == "on" || value == "yes";
  }
  if (server.hasArg("plain")) return readJsonBool(server.arg("plain"), key, fallback);
  return fallback;
}

bool loadSettings() {
  setDefaultSettings();
  if (!LittleFS.exists(CONFIG_PATH)) {
    sanitizeSettings();
    return false;
  }
  File file = LittleFS.open(CONFIG_PATH, "r");
  if (!file) {
    sanitizeSettings();
    return false;
  }
  String json = file.readString();
  file.close();

  settings.apSsid = readJsonString(json, "apSsid");
  settings.apPassword = readJsonString(json, "apPassword");
  settings.adminPassword = readJsonString(json, "adminPassword");
  settings.relayPins[0] = readJsonString(json, "relay1Pin");
  settings.relayPins[1] = readJsonString(json, "relay2Pin");
  settings.relayPins[2] = readJsonString(json, "relay3Pin");
  settings.coinPin = readJsonString(json, "coinPin");
  settings.relayActiveLow = readJsonBool(json, "relayActiveLow", DEFAULT_RELAY_ACTIVE_LOW);
  settings.secondsPerCoin = (uint32_t)readJsonInt(json, "secondsPerCoin", 300);
  settings.portEnabled[0] = readJsonBool(json, "port1Enabled", true);
  settings.portEnabled[1] = readJsonBool(json, "port2Enabled", true);
  settings.portEnabled[2] = readJsonBool(json, "port3Enabled", true);
  sanitizeSettings();
  return true;
}

bool saveSettings() {
  sanitizeSettings();
  File file = LittleFS.open(CONFIG_PATH, "w");
  if (!file) return false;
  file.print("{\n");
  file.print("  \"apSsid\":\""); file.print(jsonEscape(settings.apSsid)); file.print("\",\n");
  file.print("  \"apPassword\":\""); file.print(jsonEscape(settings.apPassword)); file.print("\",\n");
  file.print("  \"adminPassword\":\""); file.print(jsonEscape(settings.adminPassword)); file.print("\",\n");
  file.print("  \"relay1Pin\":\""); file.print(jsonEscape(settings.relayPins[0])); file.print("\",\n");
  file.print("  \"relay2Pin\":\""); file.print(jsonEscape(settings.relayPins[1])); file.print("\",\n");
  file.print("  \"relay3Pin\":\""); file.print(jsonEscape(settings.relayPins[2])); file.print("\",\n");
  file.print("  \"coinPin\":\""); file.print(jsonEscape(settings.coinPin)); file.print("\",\n");
  file.print("  \"relayActiveLow\":"); file.print(settings.relayActiveLow ? "true" : "false"); file.print(",\n");
  file.print("  \"secondsPerCoin\":"); file.print(settings.secondsPerCoin); file.print(",\n");
  file.print("  \"port1Enabled\":"); file.print(settings.portEnabled[0] ? "true" : "false"); file.print(",\n");
  file.print("  \"port2Enabled\":"); file.print(settings.portEnabled[1] ? "true" : "false"); file.print(",\n");
  file.print("  \"port3Enabled\":"); file.print(settings.portEnabled[2] ? "true" : "false"); file.print("\n");
  file.print("}\n");
  file.close();
  return true;
}

void scheduleReboot(unsigned long delayMs) {
  rebootPending = true;
  rebootAtMs = millis() + delayMs;
}

void setRelay(int index, bool on) {
  if (index < 0 || index > 2) return;
  if (ports[index].relayOn == on) return;
  ports[index].relayOn = on;
  digitalWrite(relayGpio(index), on ? relayOnLevel() : relayOffLevel());
  Serial.print("RELAY_");
  Serial.print(index + 1);
  Serial.println(on ? "_ON" : "_OFF");
}

void syncRelayState(int index) {
  bool shouldBeOn = settings.portEnabled[index] && ports[index].remaining > 0;
  if (relayTestActive[index]) shouldBeOn = true;
  setRelay(index, shouldBeOn);
}

void syncAllRelays() {
  for (int i = 0; i < 3; i++) syncRelayState(i);
}

void configureIoPins() {
  sanitizeSettings();
  for (int i = 0; i < 3; i++) {
    ports[i].remaining = 0;
    ports[i].relayOn = false;
    uint8_t pin = relayGpio(i);
    digitalWrite(pin, relayOffLevel());
    pinMode(pin, OUTPUT);
    digitalWrite(pin, relayOffLevel());
  }
  pinMode(coinGpio(), INPUT_PULLUP);
  coinRawActive = digitalRead(coinGpio()) == LOW;
  coinStableActive = coinRawActive;
  coinRawChangedMs = millis();

  Serial.print("RELAY_1_PIN:");
  Serial.println(settings.relayPins[0]);
  Serial.print("RELAY_2_PIN:");
  Serial.println(settings.relayPins[1]);
  Serial.print("RELAY_3_PIN:");
  Serial.println(settings.relayPins[2]);
  Serial.print("COIN_PIN:");
  Serial.println(settings.coinPin);
}

bool isSupportedCoinValue(uint8_t value) {
  return value == 1 || value == 5 || value == 10 || value == 20;
}

void finalizeCoinTrain() {
  if (pendingCoinPulses == 0) return;

  uint8_t coinValue = pendingCoinPulses;
  pendingCoinPulses = 0;

  if (!isSupportedCoinValue(coinValue)) {
    lastCoinValue = 0;
    Serial.print("COIN_VALUE_REJECTED_PULSES:");
    Serial.println(coinValue);
    return;
  }

