itsmejay18/Piso-Power-Station-Project-ESP32-IOT/piso-charging-esp8266/src/main.cpp
  lastCoinValue = coinValue;
  coinValueTotal += coinValue;
  uint32_t addedSeconds = (uint32_t)coinValue * settings.secondsPerCoin;
  creditSeconds += addedSeconds;

  Serial.print("COIN_VALUE_ACCEPTED:");
  Serial.println(coinValue);
  Serial.print("COIN_TIME_ADDED_SECONDS:");
  Serial.println(addedSeconds);
  Serial.print("CREDIT_SECONDS:");
  Serial.println(creditSeconds);
}

void addCoinValueCredit(uint8_t coinValue) {
  if (!isSupportedCoinValue(coinValue)) return;
  lastCoinValue = coinValue;
  coinValueTotal += coinValue;
  coinPulses += coinValue;
  uint32_t addedSeconds = (uint32_t)coinValue * settings.secondsPerCoin;
  creditSeconds += addedSeconds;
  Serial.print("SIMULATED_COIN_VALUE:");
  Serial.println(coinValue);
  Serial.print("CREDIT_SECONDS:");
  Serial.println(creditSeconds);
}

bool addTestTimeToPort(int index, uint8_t pesoValue) {
  if (index < 0 || index > 2) return false;
  if (!settings.portEnabled[index]) return false;
  if (!isSupportedCoinValue(pesoValue)) return false;
  ports[index].remaining += (uint32_t)pesoValue * settings.secondsPerCoin;
  syncRelayState(index);
  Serial.print("PORT_");
  Serial.print(index + 1);
  Serial.print("_TEST_TIME_ADDED_PHP:");
  Serial.println(pesoValue);
  return true;
}

void registerCoinPulse() {
  coinPulses++;
  if (pendingCoinPulses < 30) pendingCoinPulses++;
  lastCoinPulseMs = millis();
  Serial.print("COIN_PULSE_DETECTED:");
  Serial.println(coinPulses);
  Serial.print("PENDING_COIN_PULSES:");
  Serial.println(pendingCoinPulses);
}

void updateCoinInput() {
  bool rawActive = digitalRead(coinGpio()) == LOW;
  unsigned long now = millis();
  if (rawActive != coinRawActive) {
    coinRawActive = rawActive;
    coinRawChangedMs = now;
  }
  if (rawActive != coinStableActive && now - coinRawChangedMs >= COIN_DEBOUNCE_MS) {
    coinStableActive = rawActive;
    if (coinStableActive) registerCoinPulse();
  }
}

void updateCoinTrain() {
  if (pendingCoinPulses > 0 && millis() - lastCoinPulseMs >= COIN_TRAIN_TIMEOUT_MS) {
    finalizeCoinTrain();
  }
}

void updateTimers() {
  unsigned long now = millis();
  while (now - lastTimerMs >= 1000UL) {
    lastTimerMs += 1000UL;
    for (int i = 0; i < 3; i++) {
      if (ports[i].remaining > 0) {
        ports[i].remaining--;
        if (ports[i].remaining == 0) {
          Serial.print("PORT_");
          Serial.print(i + 1);
          Serial.println("_TIME_EXPIRED");
        }
      }
      syncRelayState(i);
    }
  }
}

void updateRelayTests() {
  unsigned long now = millis();
  for (int i = 0; i < 3; i++) {
    if (relayTestActive[i] && (long)(now - relayTestUntilMs[i]) >= 0) {
      relayTestActive[i] = false;
      syncRelayState(i);
    }
  }
}

String uptimeText() {
  unsigned long seconds = millis() / 1000UL;
  unsigned long days = seconds / 86400UL;
  seconds %= 86400UL;
  unsigned int hours = seconds / 3600UL;
  seconds %= 3600UL;
  unsigned int minutes = seconds / 60UL;
  unsigned int secs = seconds % 60UL;

  char buffer[28];
  if (days > 0) {
    snprintf(buffer, sizeof(buffer), "%lud %02u:%02u:%02u", days, hours, minutes, secs);
  } else {
    snprintf(buffer, sizeof(buffer), "%02u:%02u:%02u", hours, minutes, secs);
  }
  return String(buffer);
}

String statusJson() {
  String body = "{";
  body += "\"creditSeconds\":"; body += String(creditSeconds); body += ",";
  body += "\"coinPulses\":"; body += String(coinPulses); body += ",";
  body += "\"coinValueTotal\":"; body += String(coinValueTotal); body += ",";
  body += "\"lastCoinValue\":"; body += String(lastCoinValue); body += ",";
  body += "\"pendingCoinPulses\":"; body += String(pendingCoinPulses); body += ",";
  body += "\"ports\":[";
  for (int i = 0; i < 3; i++) {
    if (i > 0) body += ",";
    body += "{";
    body += "\"id\":"; body += String(i + 1); body += ",";
    body += "\"enabled\":"; body += (settings.portEnabled[i] ? "true" : "false"); body += ",";
    body += "\"active\":"; body += (ports[i].relayOn ? "true" : "false"); body += ",";
    body += "\"remaining\":"; body += String(ports[i].remaining);
    body += "}";
  }
  body += "],";
  body += "\"uptime\":"; body += String(millis() / 1000UL); body += ",";
  body += "\"uptimeText\":\""; body += uptimeText(); body += "\",";
  body += "\"freeHeap\":"; body += String(ESP.getFreeHeap()); body += ",";
  body += "\"ip\":\""; body += WiFi.softAPIP().toString(); body += "\",";
  body += "\"apSsid\":\""; body += jsonEscape(settings.apSsid); body += "\",";
  body += "\"relayActiveMode\":\""; body += (settings.relayActiveLow ? "LOW" : "HIGH"); body += "\",";
  body += "\"secondsPerCoin\":"; body += String(settings.secondsPerCoin); body += ",";
  body += "\"coinPin\":\""; body += jsonEscape(settings.coinPin); body += "\"";
  body += "}";
  return body;
}

String settingsJson() {
  String body = "{";
  body += "\"apSsid\":\""; body += jsonEscape(settings.apSsid); body += "\",";
  body += "\"apPasswordSet\":"; body += (settings.apPassword.length() >= 8 ? "true" : "false"); body += ",";
  body += "\"relay1Pin\":\""; body += jsonEscape(settings.relayPins[0]); body += "\",";
  body += "\"relay2Pin\":\""; body += jsonEscape(settings.relayPins[1]); body += "\",";
  body += "\"relay3Pin\":\""; body += jsonEscape(settings.relayPins[2]); body += "\",";
  body += "\"coinPin\":\""; body += jsonEscape(settings.coinPin); body += "\",";
  body += "\"relayActiveMode\":\""; body += (settings.relayActiveLow ? "LOW" : "HIGH"); body += "\",";
  body += "\"secondsPerCoin\":"; body += String(settings.secondsPerCoin); body += ",";
  body += "\"port1Enabled\":"; body += (settings.portEnabled[0] ? "true" : "false"); body += ",";
  body += "\"port2Enabled\":"; body += (settings.portEnabled[1] ? "true" : "false"); body += ",";
  body += "\"port3Enabled\":"; body += (settings.portEnabled[2] ? "true" : "false");
  body += "}";
  return body;
}

bool transferCreditToPort(int index) {
  if (index < 0 || index > 2) return false;
  if (!settings.portEnabled[index]) return false;
  if (creditSeconds == 0) return false;
  ports[index].remaining += creditSeconds;
  creditSeconds = 0;
  syncRelayState(index);
  Serial.print("PORT_");
  Serial.print(index + 1);
  Serial.print("_STARTED_REMAINING:");
  Serial.println(ports[index].remaining);
  return true;
}

String generateSessionToken() {
  String token = String(ESP.getChipId(), HEX);
  token += "-";
  token += String(millis(), HEX);
  token += "-";
  token += String(random(0x7fffffff), HEX);
  return token;
}

bool hasValidSession() {
  if (sessionToken.length() == 0) return false;
  if (!server.hasHeader("Cookie")) return false;
  String cookie = server.header("Cookie");
  return cookie.indexOf("PISOSESSION=" + sessionToken) >= 0;
}

bool requireAdmin() {
  if (hasValidSession()) return true;
  sendJson(401, "{\"ok\":false,\"message\":\"Admin login required\"}");
  return false;
}

void redirectTo(const String& target) {
  server.sendHeader("Location", target, true);
  server.send(302, "text/plain", "");
}

void redirectToPortalRoot() {
  redirectTo("http://10.20.30.1/");
}

void handleRoot() {
  serveFile("/index.html");
}

void handleAdminPage() {
  if (!hasValidSession()) {
    redirectTo("/admin/login");
    return;
  }
  serveFile("/index.html");
}

void handleAdminLoginPage() {
  serveFile("/index.html");
}

void handleApiStatus() {
  sendJson(200, statusJson());
}

