itsmejay18/Piso-Power-Station-Project-ESP32-IOT/piso-charging-esp8266/src/main.cpp
void handleApiStart() {
  int port = requestInt("port", 0);
  int index = port - 1;
  if (index < 0 || index > 2) {
    sendJson(400, "{\"ok\":false,\"message\":\"Choose Port 1, 2, or 3\"}");
    return;
  }
  if (!settings.portEnabled[index]) {
    sendJson(403, "{\"ok\":false,\"message\":\"Selected port is disabled\"}");
    return;
  }
  if (creditSeconds == 0) {
    sendJson(409, "{\"ok\":false,\"message\":\"Insert coin first\"}");
    return;
  }
  transferCreditToPort(index);
  sendJson(200, statusJson());
}

void handleApiAddCreditToPort() {
  handleApiStart();
}

void handleAdminLogin() {
  String username = requestValue("username");
  String password = requestValue("password");
  if (username == "admin" && password == settings.adminPassword) {
    sessionToken = generateSessionToken();
    server.sendHeader("Set-Cookie", "PISOSESSION=" + sessionToken + "; Path=/; Max-Age=86400; SameSite=Lax");
    Serial.println("ADMIN_LOGIN_SUCCESS");
    sendJson(200, "{\"ok\":true}");
  } else {
    Serial.println("ADMIN_LOGIN_FAILED");
    sendJson(401, "{\"ok\":false,\"message\":\"Invalid username or password\"}");
  }
}

void handleAdminLogout() {
  sessionToken = "";
  server.sendHeader("Set-Cookie", "PISOSESSION=; Path=/; Max-Age=0; SameSite=Lax");
  sendJson(200, "{\"ok\":true}");
}

void handleAdminGetSettings() {
  if (!requireAdmin()) return;
  sendJson(200, settingsJson());
}

void handleAdminSaveSettings() {
  if (!requireAdmin()) return;

  Settings next = settings;
  String apSsid = requestValue("apSsid");
  String apPassword = requestValue("apPassword");
  String relayActiveMode = requestValue("relayActiveMode");
  relayActiveMode.trim();
  relayActiveMode.toUpperCase();

  apSsid.trim();
  if (apSsid.length() == 0) {
    sendJson(400, "{\"ok\":false,\"message\":\"AP SSID is required\"}");
    return;
  }
  if (apPassword.length() > 0 && apPassword.length() < 8) {
    sendJson(400, "{\"ok\":false,\"message\":\"AP password must be at least 8 characters\"}");
    return;
  }

  next.apSsid = apSsid;
  if (apPassword.length() > 0) next.apPassword = apPassword;
  next.relayPins[0] = normalizePinName(requestValue("relay1Pin"), "");
  next.relayPins[1] = normalizePinName(requestValue("relay2Pin"), "");
  next.relayPins[2] = normalizePinName(requestValue("relay3Pin"), "");
  next.coinPin = normalizePinName(requestValue("coinPin"), "");
  next.relayActiveLow = relayActiveMode != "HIGH";
  next.secondsPerCoin = (uint32_t)requestInt("secondsPerCoin", settings.secondsPerCoin);
  next.portEnabled[0] = requestBool("port1Enabled", true);
  next.portEnabled[1] = requestBool("port2Enabled", true);
  next.portEnabled[2] = requestBool("port3Enabled", true);

  if (next.relayPins[0].length() == 0 || next.relayPins[1].length() == 0 ||
      next.relayPins[2].length() == 0 || next.coinPin.length() == 0) {
    sendJson(400, "{\"ok\":false,\"message\":\"Choose safe pins only: D1, D2, D5, D6, D7\"}");
    return;
  }
  if (!pinNamesAreUnique(next.relayPins[0], next.relayPins[1], next.relayPins[2], next.coinPin)) {
    sendJson(400, "{\"ok\":false,\"message\":\"Relay and coin pins must be unique\"}");
    return;
  }
  if (next.secondsPerCoin < 10 || next.secondsPerCoin > 86400UL) {
    sendJson(400, "{\"ok\":false,\"message\":\"Seconds per peso must be 10 to 86400\"}");
    return;
  }

  Settings previous = settings;
  settings = next;
  sanitizeSettings();
  if (!saveSettings()) {
    settings = previous;
    sendJson(500, "{\"ok\":false,\"message\":\"Failed to save settings\"}");
    return;
  }
  Serial.println("SETTINGS_SAVED");
  sendJson(200, "{\"ok\":true,\"message\":\"Settings saved. Rebooting\"}");
  scheduleReboot(1200);
}

void handleAdminResetSettings() {
  if (!requireAdmin()) return;
  LittleFS.remove(CONFIG_PATH);
  setDefaultSettings();
  Serial.println("SETTINGS_RESET_TO_DEFAULTS");
  sendJson(200, "{\"ok\":true,\"message\":\"Defaults restored. Rebooting\"}");
  scheduleReboot(1000);
}

void handleAdminTestRelay() {
  if (!requireAdmin()) return;
  int relay = requestInt("relay", 0);
  int index = relay - 1;
  if (index < 0 || index > 2) {
    sendJson(400, "{\"ok\":false,\"message\":\"Choose relay 1, 2, or 3\"}");
    return;
  }
  relayTestActive[index] = true;
  relayTestUntilMs[index] = millis() + RELAY_TEST_MS;
  syncRelayState(index);
  Serial.print("RELAY_");
  Serial.print(index + 1);
  Serial.println("_TEST");
  sendJson(200, statusJson());
}

void handleApiSimulateCoin() {
  int value = requestInt("value", 0);
  if (!isSupportedCoinValue((uint8_t)value)) {
    sendJson(400, "{\"ok\":false,\"message\":\"Choose PHP 1, 5, 10, or 20\"}");
    return;
  }
  addCoinValueCredit((uint8_t)value);
  sendJson(200, statusJson());
}

void handleApiAddTestTime() {
  int port = requestInt("port", 0);
  int value = requestInt("value", 1);
  int index = port - 1;
  if (index < 0 || index > 2) {
    sendJson(400, "{\"ok\":false,\"message\":\"Choose Port 1, 2, or 3\"}");
    return;
  }
  if (!addTestTimeToPort(index, (uint8_t)value)) {
    sendJson(400, "{\"ok\":false,\"message\":\"Port disabled or invalid test value\"}");
    return;
  }
  sendJson(200, statusJson());
}

void handleAdminSimulateCoin() {
  if (!requireAdmin()) return;
  handleApiSimulateCoin();
}

void handleAdminAddTestTime() {
  if (!requireAdmin()) return;
  handleApiAddTestTime();
}

void handleNotFound() {
  if (server.method() == HTTP_GET && serveFile(server.uri())) return;
  if (server.method() == HTTP_GET) {
    redirectToPortalRoot();
    return;
  }
  sendJson(404, "{\"ok\":false,\"message\":\"Not found\"}");
}

void setupRoutes() {
  server.collectHeaders("Cookie");

  server.on("/", HTTP_GET, handleRoot);
  server.on("/admin", HTTP_GET, handleAdminPage);
  server.on("/admin/login", HTTP_GET, handleAdminLoginPage);
  server.on("/api/status", HTTP_GET, handleApiStatus);
  server.on("/api/start", HTTP_POST, handleApiStart);
  server.on("/api/add-credit-to-port", HTTP_POST, handleApiAddCreditToPort);
  server.on("/api/simulate-coin", HTTP_POST, handleApiSimulateCoin);
  server.on("/api/add-test-time", HTTP_POST, handleApiAddTestTime);
  server.on("/admin/api/login", HTTP_POST, handleAdminLogin);
  server.on("/admin/api/logout", HTTP_POST, handleAdminLogout);
  server.on("/admin/api/settings", HTTP_GET, handleAdminGetSettings);
  server.on("/admin/api/save-settings", HTTP_POST, handleAdminSaveSettings);
  server.on("/admin/api/reset-settings", HTTP_POST, handleAdminResetSettings);
  server.on("/admin/api/test-relay", HTTP_POST, handleAdminTestRelay);
  server.on("/admin/api/simulate-coin", HTTP_POST, handleAdminSimulateCoin);
  server.on("/admin/api/add-test-time", HTTP_POST, handleAdminAddTestTime);
  server.onNotFound(handleNotFound);
}

void startAccessPoint() {
  WiFi.persistent(false);
  WiFi.mode(WIFI_OFF);
  delay(100);
  WiFi.mode(WIFI_AP_STA);
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  WiFi.setOutputPower(17.0f);
  WiFi.softAPConfig(AP_IP, AP_GATEWAY, AP_SUBNET);
  bool ok = WiFi.softAP(settings.apSsid.c_str(), settings.apPassword.c_str(), 6, false, 4);
  dnsServer.start(DNS_PORT, "*", AP_IP);

  Serial.println(ok ? "AP_STARTED" : "AP_START_FAILED");
  Serial.print("AP_SSID:");
  Serial.println(settings.apSsid);
  Serial.print("AP_IP:");
  Serial.println(WiFi.softAPIP());
}

void setup() {
  Serial.begin(115200);
  delay(200);
  randomSeed(ESP.getCycleCount());
  Serial.print("RESET_REASON:");
  Serial.println(ESP.getResetReason());

  if (!LittleFS.begin()) {
    Serial.println("LITTLEFS_MOUNT_FAILED_FORMATTING");
    LittleFS.format();
    LittleFS.begin();
  }

  loadSettings();
  configureIoPins();
  lastTimerMs = millis();
  startAccessPoint();
  setupRoutes();
  server.begin();
  Serial.println("PISO_CHARGE_PRO_PORTAL_STARTED");
}

void loop() {
  dnsServer.processNextRequest();
  server.handleClient();
  updateCoinInput();
  updateCoinTrain();
  updateTimers();
  updateRelayTests();

  if (rebootPending && (long)(millis() - rebootAtMs) >= 0) {
    for (int i = 0; i < 3; i++) {
      digitalWrite(relayGpio(i), relayOffLevel());
    }
    delay(100);
    ESP.restart();
  }
  delay(1);
}
